app/views/users/dashboard.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? AND (DATE(created_at) < '2017-01-31')  [["user_id", 11]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ? AND (DATE(created_at) < '2017-01-31')  [["user_id", 11]]
---
      <h3 class="text-primary">What's on the list:</h3>
      <% if current_user.items_expiring_today.count == 0 %>