app/views/items/_item.html.erb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ? AND (DATE(created_at) >= '2017-01-30')  [["user_id", 11]]
---
<% current_user.items.each do |item| %>