app/controllers/items_controller.rb

  def create
    @item = Item.new
    @user = current_user.items
    @item.name = params[:item][:name]
    @item.user_id = current_user.id
    @item.user = current_user

    if @item.save
---
INSERT INTO "items" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Go to the mall"], ["user_id", 1], ["created_at", "2017-01-26 05:52:51.222370"], ["updated_at", "2017-01-26 05:52:51.222370"]]

  def destroy
    @item = Item.find(params[:id])

    if @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 11]]